DO-2023/Meta 4/Tipos de contratos y codigo de ética.tex
% Created 2023-11-02 jue 12:26
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{../modern}
\raggedbottom
\setcounter{secnumdepth}{2}
\author{Luis Eduardo Galindo Amaya (1274895)}
\date{miércoles, 01 noviembre 2023}
\title{Meta 4\\\medskip
\large Tipos de contratos y codigo de ética}
\hypersetup{
 pdfauthor={Luis Eduardo Galindo Amaya (1274895)},
 pdftitle={Meta 4},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={Spanish}}
\begin{document}

\modentitlepage{../images/escudo-uabc-2022-1-tinta-pos.png}
\datasection{Individual}

\section{Ensayo}
\label{sec:org61e65de}
En ingeniería en software tener un trato claro sobre las cosas que se
van a hacer permite mantener un control durante el desarrollo, si los
integrantes del equipo conocen hasta donde llegan sus funciones esto
ayuda a evitar que los miembros del equipo se no se sientan
remunerados de manera justa.

\begin{itemize}
\item Partes con capacidad jurídica suficiente para suscribir el acuerdo
de licencia de software.
\item Definiciones de términos contractuales donde puede tener especial
incidencia, entre otras, la definición de cliente.
\item Objeto del contrato de software, debiendo prestar especial atención
a si el uso del software es interno o se autoriza para dar servicios
a terceros.
\item Duración.
\item Tratamiento de propiedad intelectual (marcas, know how, etc.).
\item Cláusula de confidencialidad.
\item Cláusula de auditoría de licenciamiento de software.
\item Entrega e instalación.
\item Garantía.
\item Gastos e Impuestos.
\end{itemize}

Así mismo, el formato de contrato de software puede contener anexos en
los que pueden detallarse los productos adquiridos, el precio, el modo
de pago, el contrato de soporte y mantenimiento del software, las
políticas de licenciamiento de software, etc. \\

En base al tipo de proyecto se debe elegir el contrato que mas se
ajuste, por ejemplo sí el proyecto tiene un final claro no es
necesario tener un contrato \textbf{indefinido} esto también beneficia al
cliente ya que no tendrá que comprometerse por mas tiempo del que sea
necesario. 
\end{document}
